In [1]:
import pandas as pd

In [5]:
dict_3 = {'first': pd.Series([1., 2., 3.], index=[1, 2, 3]),
         'second': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
df_2

   first  second
1    1.0     NaN
2    2.0     NaN
3    3.0     NaN
a    NaN     1.0
b    NaN     2.0
c    NaN     3.0
d    NaN     4.0

In [6]:
dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
pd.DataFrame.from_dict(dict([('A', [1,2,3]), ('B', [4,5,6])]),
                      orient='index', columns=['one','two','three'])

   one  two  three
A    1    2      3
B    4    5      6

In [12]:
import numpy as np

# Create random matrix 2x3 with values between 10 and 50
arr_2 = np.random.randint(10, 50, size=(2, 3))

# Create DF with data, row labels & column labels
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])


# Grabb a row as a series
df_1.loc['A']
# Grab row by index position
df_1.iloc[1]

C    41
D    46
E    46
Name: B, dtype: int64

In [14]:

# Groupby allows you to group rows based on a columnand perform a function
# that combines those values (Aggregate Function)
dict_5 = {'Store': [1,2,1,2], 'Flavor': ['Choc', 'Van', 'Straw', 'Choc'], 
         'Sales': [26, 12, 18, 22]}

df_11 = pd.DataFrame(dict_5)

df_11

   Store Flavor  Sales
0      1   Choc     26
1      2    Van     12
2      1  Straw     18
3      2   Choc     22

In [15]:
# Group data by the store number
by_store = df_11.groupby('Store')
# Get mean sales by store
by_store.mean()

       Sales
Store
1         22
2         17

In [16]:
# Get sales total just for store 1
by_store.sum().loc[1]

Sales    44
Name: 1, dtype: int64

In [17]:
# You can use multiple functions of get a bunch
by_store.describe()

      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

In [18]:

# You can concatenate DFs in the order DFs are provided
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12]},
                    index=[4,5,6])
pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [21]:
# Merge 2 DFs using their shared key column
df_12 = pd.DataFrame({'C': [1,2,3],
                     'D': [4,5,6],
                     'key': [1,2,3]})
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12],
                     'key': [1,2,3]})
# inner merges at the intersection of keys
pd.merge(df_12, df_13, how='inner', on='key')

   C  D  key  A   B
0  1  4    1  7  10
1  2  5    2  8  11
2  3  6    3  9  12

In [22]:
# You can join DFs with different indexes and instead of using 
# keys use a column
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_13 = pd.DataFrame({'C': [7,8,9],
                     'D': [10,11,12]},
                    index=[1,4,5])
df_12.join(df_13, how='outer')

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

In [23]:

# Iterating over series
ser_7 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
for col in ser_7:
    print(col)

0
1
2
3
4

In [24]:
ser_7

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [26]:
# Iterating over DFs
arr_4 = np.random.randint(10, 50, size=(2, 3))
df_8 = pd.DataFrame(arr_4, ['B', 'C'], ['C', 'D', 'E'])
print(df_8)

    C   D   E
B  16  49  43
C  42  31  19

In [29]:
# items allows you to iterate through key value pairs to make
# calculations 1 column at a time
for label, ser in df_8.items():
#     print(label)
    print(ser)

B    16
C    42
Name: C, dtype: int64
B    49
C    31
Name: D, dtype: int64
B    43
C    19
Name: E, dtype: int64

In [31]:
# You can also iterate through rows
for index, row in df_8.iterrows():
    print(f"{index}\n{row}")

B
C    16
D    49
E    43
Name: B, dtype: int64
C
C    42
D    31
E    19
Name: C, dtype: int64